STMicroelectronics/STM32CubeWB0/Projects/NUCLEO-WB09KE/Applications/BLE/BLE_PowerControl_Central/STM32_BLE/App/gatt_client_app.c
static void gatt_parse_notification(aci_gatt_clt_notification_event_rp0 *p_evt)
{
  APP_DBG_MSG("ACI_GATT_NOTIFICATION_VSEVT_CODE - ConnHdl=0x%04X, Attribute_Handle=0x%04X\n",
              p_evt->Connection_Handle,
              p_evt->Attribute_Handle);
/* USER CODE BEGIN gatt_parse_notification_1 */
  GATT_CLIENT_APP_Notification_evt_t notification;
  uint8_t index;

  for (index = 0 ; index < CFG_BLE_NUM_CLIENT_CONTEXTS ; index++)
  {
    if (a_ClientContext[index].connHdl == p_evt->Connection_Handle)
    {
      break;
    }
  }

  if (a_ClientContext[index].connHdl == p_evt->Connection_Handle)
  {
    if (p_evt->Attribute_Handle == a_ClientContext[index].Switch_CValueHdle)
    {
      APP_DBG_MSG("  Incoming Nofification received Peripheral information [p_evt->Connection_Handle:0x%04X]\n", p_evt->Connection_Handle);
      notification.Client_Evt_Opcode = APP_NOTIFICATION_INFO_RECEIVED_EVT;
      notification.DataTransfered.length = p_evt->Attribute_Value_Length;
      notification.DataTransfered.p_Payload = &p_evt->Attribute_Value[0];

      gatt_Notification(&notification);
    }
  }
  else
  {
    APP_DBG_MSG("ACI_GATT_NOTIFICATION_VSEVT_CODE, failed handle not found in connection table !\n");
  }
/* USER CODE END gatt_parse_notification_1 */

  return;
}

static void client_discover_all(void)
{
  uint8_t index;

  for(index = 0; index < CFG_BLE_NUM_CLIENT_CONTEXTS; index++)
  {
    if(a_ClientContext[index].state == GATT_CLIENT_APP_DISCOVER_SERVICES)
    {
      gatt_procedure(index, PROC_GATT_DISC_ALL_PRIMARY_SERVICES);
      gatt_procedure(index, PROC_GATT_DISC_ALL_CHARS);
      gatt_procedure(index, PROC_GATT_DISC_ALL_DESCS);
      gatt_procedure(index, PROC_GATT_ENABLE_ALL_NOTIFICATIONS);

      a_ClientContext[index].state = GATT_CLIENT_APP_CONNECTED;

      /* Check if in the meantime another server has been connected. */
      UTIL_SEQ_SetTask( 1U << CFG_TASK_DISCOVER_SERVICES_ID, CFG_SEQ_PRIO_0);

      break;
    }
  }

  return;
}

static void gatt_cmd_resp_release(void)
{
  UTIL_SEQ_SetEvt(1U << CFG_IDLEEVT_PROC_GATT_COMPLETE);
  return;
}

static void gatt_cmd_resp_wait(void)
{
  UTIL_SEQ_WaitEvt(1U << CFG_IDLEEVT_PROC_GATT_COMPLETE);
  return;
}

/* USER CODE BEGIN LF */

static void Central_Write_Char(void)
{
  uint8_t index = 0;
  tBleStatus ret = BLE_STATUS_INVALID_PARAMS;

  if (sButtonData.level == 0x00)
  {
    sButtonData.level = 0x01;
  }
  else
  {
    sButtonData.level = 0x00;
  }

  for(index = 0; index < CFG_BLE_NUM_CLIENT_CONTEXTS; index++)
  {
    if (a_ClientContext[index].state == GATT_CLIENT_APP_CONNECTED)
    {
      ret = aci_gatt_clt_write_without_resp(a_ClientContext[index].connHdl,
                                            BLE_GATT_UNENHANCED_ATT_L2CAP_CID,
                                            a_ClientContext[index].Led_CValueHdle,
                                            2,
                                            (uint8_t *)&sButtonData);

      if (ret != BLE_STATUS_SUCCESS)
      {
        APP_DBG_MSG("aci_gatt_clt_write_without_resp failed, connHdl=0x%04X, ValueHdl=0x%04X\n",
                    a_ClientContext[index].connHdl,
                    a_ClientContext[index].Led_CValueHdle);
      }
      else
      {
        APP_DBG_MSG("* ");
      }
      
    }
  }

  return;
}

/* USER CODE END LF */
